index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-17 Tue 09:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Stock Market Indices</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Stock Market Indices</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdb85e50">1. Price-Weighted Index (DJIA)</a></li>
<li><a href="#org645f318">2. Value-Weighted (S&amp;P 500)</a>
<ul>
<li><a href="#orgc35221e">2.1. Index Creation</a></li>
</ul>
</li>
<li><a href="#org99161e3">3. Equal-Weight Indices</a></li>
</ul>
</div>
</div>
<p>
Here we'll take a look at price and value-weighted stock indices. Say our index covers two stocks (A and B) with the following number of shares outstanding.
</p>

<table id="org93b731e" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Stock</th>
<th scope="col" class="org-right">Shares Outstanding</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">50</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">300</td>
</tr>
</tbody>
</table>

<p>
We'll consider the price of each stock over two days:
</p>

<table id="orga2a40c9" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Stock</th>
<th scope="col" class="org-right">Price Day 1 ($)</th>
<th scope="col" class="org-right">Price Day 2 ($)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">200</td>
<td class="org-right">190</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">30</td>
<td class="org-right">35</td>
</tr>
</tbody>
</table>

<div id="outline-container-orgdb85e50" class="outline-2">
<h2 id="orgdb85e50"><span class="section-number-2">1.</span> Price-Weighted Index (DJIA)</h2>
<div class="outline-text-2" id="text-1">
<p>
To construct a price-weighted index we can simply average the prices each day (sum them and here divide by 2).  The only complication arises when a stock in the index splits.  We don't want the split to affect the index value, so we adjust the divisor.  
</p>

<p>
For example, say stock A splits on day 2.  For the index value to stay the same, we have to make the divisor (d):
</p>

<p>
\[112.5=\frac{35 + 95}{d} \Rightarrow d = \frac{130}{112.5} = 1.1555\]
</p>

<p>
Obviously, in a price-weighted index 
</p>

<blockquote>
<p>
The stock with the highest price has the largest effect on the index.
</p>
</blockquote>

<p>
This may be undesirable, depending on your use for the index, because a stock's price is not a meaningful value&#x2014;a high price does not mean a large market cap.
</p>

<p>
A price weighted-index tracks:
</p>

<blockquote>
<p>
The performance of a portfolio comprised of one share of each stock in the index.
</p>
</blockquote>


<table id="orgad6edc8" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Day</th>
<th scope="col" class="org-right">Index Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">115</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">112.5</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">% Change</td>
<td class="org-right">-0.021739130</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org645f318" class="outline-2">
<h2 id="org645f318"><span class="section-number-2">2.</span> Value-Weighted (S&amp;P 500)</h2>
<div class="outline-text-2" id="text-2">
<p>
A value-weighted index considers the market cap of a firm, rather than its price.  This is a more reasonable measure than price.  Note the market cap of a firm is not its total size (which is the enterprise value and includes debt).
</p>

<blockquote>
<p>
The stock with the highest market cap has the largest effect on the index.
</p>
</blockquote>

<p>
Generally, the larger your portfolio the more similar your portfolio weights for each stock will be to the weights in the market index.  This is why the performance of large portfolios are compared to the market index (which is value-weighted).
</p>

<table id="orgcebe3d2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Day</th>
<th scope="col" class="org-right">Market Cap A</th>
<th scope="col" class="org-right">Market Cap B</th>
<th scope="col" class="org-right">Total Market Cap</th>
<th scope="col" class="org-right">Index Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">10000</td>
<td class="org-right">9000</td>
<td class="org-right">19000</td>
<td class="org-right">100</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">9500</td>
<td class="org-right">10500</td>
<td class="org-right">20000</td>
<td class="org-right">105.26316</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">% Change</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">0.0526316</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-orgc35221e" class="outline-3">
<h3 id="orgc35221e"><span class="section-number-3">2.1.</span> Index Creation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To create a market-value index we choose some start date and starting value&#x2014;commonly 100. 
</p>

<p>
\(100*\frac{P_1}{P_0}\frac{P_2}{P_1}\frac{P_3}{P_2}\frac{P_4}{P_3}\frac{P_5}{P_4} = 100\frac{P_5}{P_0}\)
</p>
</div>
</div>
</div>


<div id="outline-container-org99161e3" class="outline-2">
<h2 id="org99161e3"><span class="section-number-2">3.</span> Equal-Weight Indices</h2>
<div class="outline-text-2" id="text-3">
<p>
There is a class of indices where each asset in the index has an equal weight in the index value. These indices are fairly unimportant.  
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2024-09-17 Tue 09:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
